# Задача 1: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

#n = (input('Введите трёхзначное число: '))
#a = int(n[0])
#b = int(n[1])
#c = int(n[2])
#print(a + b + c)


n = int(input('Введите трёхзначное число: '))
n1 = n%10
n2 = n%100//10
n3 = n//100
print(n1 + n2 + n3)